month = int(input("Введите месяц числом от 1 до 12 = "))
month_dict = {1: "Январь",
              2: "Февраль",
              3: "Март",
              4: "Апрель",
              5: "Май",
              6: "Июнь",
              7: "Июль",
              8: "Август",
              9: "Сентябрь",
              10: "Октябрь",
              11: "Ноябрь",
              12: "Декабрь"}
month_season = {12: "Зимний",
                1: "Зимний",
                2: "Зимний",
                3: "Весенний",
                4: "Весенний",
                5: "Весенний",
                6: "Летний",
                7: "Летний",
                8: "Летний",
                9: "Осенний",
                10: "Осенний",
                11: "Осенний"}
if month in month_dict:
    print(f"{month} месяц года - это {month_season[month]} месяц {month_dict[month]}")
else:
    print("Введен неправильный номер месяца")